import time
hearts = ["""🧡🧡🧡🧡🧡🧡
🧡🧡❤️❤️🧡🧡
🧡🧡❤️❤️🧡🧡
🧡🧡❤️❤️🧡🧡
🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡
🧡🧡🤍🤍🧡🧡
🧡🧡🤍🤍🧡🧡
🧡🧡🤍🤍🧡🧡
🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡
🧡🧡🖤🖤🧡🧡
🧡🧡🖤🖤🧡🧡
🧡🧡🖤🖤🧡🧡
🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡
🧡🧡💚💚🧡🧡
🧡🧡💚💚🧡🧡
🧡🧡💚💚🧡🧡
🧡🧡🧡🧡🧡🧡"""]

pulse = [
"""🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡
🧡🧡❤️❤️🧡🧡
🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡
🧡🧡❤️❤️🧡🧡
🧡❤️🧡🧡❤️🧡
🧡🧡❤️❤️🧡🧡
🧡🧡🧡🧡🧡🧡""",

"""🧡🧡❤️❤️🧡🧡
🧡❤️🧡🧡❤️🧡
❤️🧡🧡🧡🧡❤️
🧡❤️🧡🧡❤️🧡
🧡🧡❤️❤️🧡🧡""",

"""❤️❤️❤️❤️❤️❤️
❤️🧡🧡🧡🧡❤️
❤️🧡🧡🧡🧡❤️
❤️🧡🧡🧡🧡❤️
❤️❤️❤️❤️❤️❤️""",

"""🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡"""
]

love = ["""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🤍🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🤍🤍🤍🧡🧡🧡
🧡🧡🧡🤍🤍🤍🧡🧡🧡
🧡🧡🧡🧡🤍🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🤍🧡🤍🧡🧡🧡
🧡🧡🤍🧡🤍🧡🤍🧡🧡
🧡🧡🤍🧡🧡🧡🤍🧡🧡
🧡🧡🧡🤍🧡🤍🧡🧡🧡
🧡🧡🧡🧡🤍🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🤍🤍🧡🤍🤍🧡🧡
🧡🤍🧡🧡🤍🧡🧡🤍🧡
🧡🤍🧡🧡🧡🧡🧡🤍🧡
🧡🧡🤍🧡🧡🧡🤍🧡🧡
🧡🧡🧡🤍🧡🤍🧡🧡🧡
🧡🧡🧡🧡🤍🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🤍🤍🧡🤍🤍🧡🧡
🧡🤍🧡🧡🤍🧡🧡🤍🧡
🧡🤍🧡🧡❤️🧡🧡🤍🧡
🧡🧡🤍🧡🧡🧡🤍🧡🧡
🧡🧡🧡🤍🧡🤍🧡🧡🧡
🧡🧡🧡🧡🤍🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🤍🤍🧡🤍🤍🧡🧡
🧡🤍🧡🧡❤️🧡🧡🤍🧡
🧡🤍🧡❤️❤️❤️🧡🤍🧡
🧡🧡🤍🧡❤️🧡🤍🧡🧡
🧡🧡🧡🤍🧡🤍🧡🧡🧡
🧡🧡🧡🧡🤍🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🤍🤍🧡🤍🤍🧡🧡
🧡🤍🧡❤️❤️❤️🧡🤍🧡
🧡🤍🧡❤️❤️❤️🧡🤍🧡
🧡🧡🤍❤️❤️❤️🤍🧡🧡
🧡🧡🧡🤍❤️🤍🧡🧡🧡
🧡🧡🧡🧡🤍🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡🤍🤍🧡🤍🤍🧡🧡
🧡🤍❤️❤️❤️❤️❤️🤍🧡
🧡🤍❤️❤️❤️❤️❤️🤍🧡
🧡🧡🤍❤️❤️❤️🤍🧡🧡
🧡🧡🧡🤍❤️🤍🧡🧡🧡
🧡🧡🧡🧡🤍🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡""",

"""🧡🧡🧡🧡🧡🧡🧡🧡🧡
🧡🧡❤️❤️🧡❤️❤️🧡🧡
🧡❤️❤️❤️❤️❤️❤️❤️🧡
🧡❤️❤️❤️❤️❤️❤️❤️🧡
🧡🧡❤️❤️❤️❤️❤️🧡🧡
🧡🧡🧡❤️❤️❤️🧡🧡🧡
🧡🧡🧡🧡❤️🧡🧡🧡🧡
🧡🧡🧡🧡🧡🧡🧡🧡🧡"""
]

class Animations:
    def __init__(self, client) -> None:
        self.hearts = hearts
        self.pulse = pulse
        self.client = client
        self.love = love
    
    async def animation(self, times=1, wait=0.1, message=None, mode='pulse', reverse=False):
        times = times if times > 0 else 1
        wait = wait if wait > 0 else 0.1
        slides = None


        if mode == 'hearts':
            slides = self.hearts
        elif mode == 'pulse':
            slides = self.pulse
        elif mode == 'love':
            slides = self.love
        
        slides = slides[::-1] if reverse else slides
        
        for i in range(times):
            for slide in slides:
                await self.client.edit_message(message, slide)
                time.sleep(wait)
